Catalogs/EUF_ПроводникТипИсходящегоСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>EUF_ПроводникТипИсходящегоСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>ExchangePlan.EUF_ПроводникВнешниеСистемы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТехническоеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтеграционныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EUF_ПроводникИнтеграционныеПроцессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/EUF_ПроводникИспользуемыеНастройкиДляСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>EUF_ПроводникИспользуемыеНастройкиДляСообщений</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаДляСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EUF_ПроводникНастройкиВходящихСообщений</v8:Type>
						<v8:Type>cfg:CatalogRef.EUF_ПроводникНастройкиИсходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EUF_ПроводникТипВходящегоСообщения</v8:Type>
						<v8:Type>cfg:CatalogRef.EUF_ПроводникТипИсходящегоСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/EUF_ПроводникТипИсходящегоСообщения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
Функция ИдентификаторТипаИсходящегоУникален(Объект, Отказ) Экспорт
	
	ТекстСообщения = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипИсходящегоСообщения.Представление КАК Представление,
	|	ТипИсходящегоСообщения.Код КАК Код
	|ИЗ
	|	Справочник.EUF_ПроводникТипИсходящегоСообщения КАК ТипИсходящегоСообщения
	|ГДЕ
	|	ТипИсходящегоСообщения.ТехническоеИмя = &ТехническоеИмя
	|	И ТипИсходящегоСообщения.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ТехническоеИмя", Объект.ТехническоеИмя);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстСообщения = СтрШаблон("Тип исходящего сообщения с таким техническим именем (мнемокодом) уже существует %1 %2",
									Выборка.Код, Выборка.Представление);		
		Отказ = Истина;							
		Возврат ТекстСообщения;		
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция УстановленСинхронныйРежим(ТипИсходящегоСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	EUF_ПроводникИспользуемыеНастройкиДляСообщенийСрезПоследних.НастройкаДляСообщения КАК НастройкаДляСообщения
	|ПОМЕСТИТЬ Настройки
	|ИЗ
	|	РегистрСведений.EUF_ПроводникИспользуемыеНастройкиДляСообщений.СрезПоследних(, ТипСообщения = &ТипИсходящегоСообщения) КАК EUF_ПроводникИспользуемыеНастройкиДляСообщенийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Настройки.НастройкаДляСообщения КАК НастройкаКвитанцииСсылка,
	|	ЕСТЬNULL(EUF_ПроводникНастройкиИсходящихСообщений.СинхронныйРежим, ЛОЖЬ) КАК СинхронныйРежим
	|ИЗ
	|	Настройки КАК Настройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.EUF_ПроводникНастройкиИсходящихСообщений КАК EUF_ПроводникНастройкиИсходящихСообщений
	|		ПО Настройки.НастройкаДляСообщения = EUF_ПроводникНастройкиИсходящихСообщений.Ссылка";
	Запрос.УстановитьПараметр("ТипИсходящегоСообщения", ТипИсходящегоСообщения);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	СинхронныйРежим = Ложь;
	Если Выборка.Следующий() Тогда
		СинхронныйРежим = Выборка.СинхронныйРежим;		
	КонецЕсли;
	
	Возврат СинхронныйРежим;
	
КонецФункции

#КонецЕсли
